tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "exercism"
brew "gh"
brew "git"
brew "gnupg"
brew "mas"
brew "node@16", link: true, conflicts_with: ["node"] || true
brew "pinentry-mac"
brew "rbenv"
brew "shellcheck"

cask "bettertouchtool"
cask "encryptme"
cask "fig"
cask "figma"
cask "google-chrome"
cask "hazel"
cask "logitech-g-hub"
cask "loopback"
cask "microsoft-teams"
cask "nova"
cask "paw"
cask "sketch"
cask "visual-studio-code"
cask "zoom"

mas "1Blocker", id: 1365531024
mas "1Password 7", id: 1333542190
mas "Capital One Shopping", id: 1477110326
mas "Deliveries", id: 290986013
mas "Gifox", id: 1461845568
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Keystroke Pro", id: 1572206224
mas "Microsoft Remote Desktop", id: 1295203466
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835