tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "gh"
brew "git"
brew "gnutls"
brew "gnupg"
brew "jq"
brew "mas"
brew "node@20"
brew "pinentry-mac"
brew "shellcheck"

cask "1password"
cask "bettertouchtool"
cask "docker"
cask "elgato-control-center"
cask "elgato-wave-link"
cask "figma"
cask "google-chrome"
cask "hazel"
cask "microsoft-teams"
cask "rapidapi"
cask "swiftdefaultappsprefpane"
cask "viscosity"
cask "visual-studio-code-insiders"
cask "zoom"

mas "Capital One Shopping", id: 1477110326
mas "Deliveries", id: 290986013
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Mapper", id: 1589391989
mas "Microsoft Remote Desktop", id: 1295203466
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
